---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.CanFlipFacing
zh: 族实例
source: html/13991f6f-3eab-0efc-8d9d-c30bfc9b1ae5.htm
---
# Autodesk.Revit.DB.FamilyInstance.CanFlipFacing Property

**中文**: 族实例

Property to test whether the orientation of family instance facing can be flipped.

## Syntax (C#)
```csharp
public bool CanFlipFacing { get; }
```